 ~/Labs/l3vpn î‚° docker exec -it clab-l3vpn-R3 vtysh

Hello, this is FRRouting (version 9.0.1_git).
Copyright 1996-2005 Kunihiro Ishiguro, et al.

R3# sh int br
Interface       Status  VRF             Addresses
---------       ------  ---             ---------
eth0            up      default         172.20.20.3/24
                                        + 2001:172:20:20::3/64
eth1            up      default         20.0.13.2/30
eth2            up      default         20.0.23.2/30
eth3            up      default         20.0.34.1/30
lo              up      default         3.3.3.3/32

R3# 
R3# sh ip route ospf
Codes: K - kernel route, C - connected, S - static, R - RIP,
       O - OSPF, I - IS-IS, B - BGP, E - EIGRP, N - NHRP,
       T - Table, v - VNC, V - VNC-Direct, A - Babel, F - PBR,
       f - OpenFabric,
       > - selected route, * - FIB route, q - queued, r - rejected, b - backup
       t - trapped, o - offload failure

O>* 1.1.1.1/32 [110/10] via 20.0.13.1, eth1, weight 1, 00:40:12
O>* 2.2.2.2/32 [110/10] via 20.0.23.1, eth2, weight 1, 00:40:02
O   3.3.3.3/32 [110/0] is directly connected, lo, weight 1, 00:40:59
O>* 4.4.4.4/32 [110/10] via 20.0.34.2, eth3, weight 1, 00:40:08
O>* 5.5.5.5/32 [110/20] via 20.0.34.2, eth3, weight 1, 00:40:03
O   20.0.13.0/30 [110/10] is directly connected, eth1, weight 1, 00:40:58
O   20.0.23.0/30 [110/10] is directly connected, eth2, weight 1, 00:40:57
O   20.0.34.0/30 [110/10] is directly connected, eth3, weight 1, 00:40:53
O>* 20.0.45.0/30 [110/20] via 20.0.34.2, eth3, weight 1, 00:40:08
R3# 
R3# sh ip ospf database

       OSPF Router with ID (3.3.3.3)

                Router Link States (Area 0.0.0.0)

Link ID         ADV Router      Age  Seq#       CkSum  Link count
2.2.2.2        2.2.2.2          803 0x80000005 0xa71d 2
3.3.3.3        3.3.3.3          784 0x8000000d 0x8c3c 4
4.4.4.4        4.4.4.4          819 0x80000008 0x678c 3
172.20.20.2    172.20.20.2      816 0x80000005 0xc627 2
172.20.20.7    172.20.20.7      784 0x80000005 0x88ad 2

                Net Link States (Area 0.0.0.0)

Link ID         ADV Router      Age  Seq#       CkSum
20.0.13.1      172.20.20.7      824 0x80000002 0x5026
20.0.23.2      3.3.3.3          784 0x80000002 0xd638
20.0.34.2      4.4.4.4          829 0x80000002 0x9364
20.0.45.2      172.20.20.2      826 0x80000002 0x1e3d


R3# conf
R3(config)# '
% Unknown command: '
R3(config)# mpls ldp
R3(config-ldp)# router-id 3.3.3.3
R3(config-ldp)# address-family ipv4 
R3(config-ldp-af)# 
  discovery            Configure discovery parameters
  end                  End current mode and change to enable mode
  exit                 Exit current mode and down to previous mode
  exit-address-family  Exit from Address Family configuration mode
  find                 Find CLI command matching a regular expression
  interface            Enable LDP on an interface and enter interface submode
  label                Configure label control and policies
  list                 Print command list
  neighbor             Configure neighbor parameters
  no                   Negate a command or set its defaults
  output               Direct vtysh output to file
  quit                 Exit current mode and down to previous mode
  session              Configure session parameters
  ttl-security         LDP ttl security check
R3(config-ldp-af)# discovery transport-address 3.3.3.3
R3(config-ldp-af)# interface 
  IFNAME  Interface's name
     eth0 eth1 eth2 eth3 lo 
R3(config-ldp-af)# interface eth1 
R3(config-ldp-af-if)# exit
R3(config-ldp-af)# interface eth2
R3(config-ldp-af-if)# exit
R3(config-ldp-af)# int eth3
R3(config-ldp-af-if)# exit
R3(config-ldp-af)# exit
R3(config-ldp)# exit
R3(config)# 
R3(config)# 
R3(config)# end
R3# 
R3# 
R3# sh mpls ldp neighbor 
AF   ID              State       Remote Address    Uptime
ipv4 1.1.1.1         OPERATIONAL 1.1.1.1         00:02:25
ipv4 2.2.2.2         OPERATIONAL 2.2.2.2         00:02:17
ipv4 4.4.4.4         OPERATIONAL 4.4.4.4         00:01:43
R3# 
R3# 
R3# 
R3# 
R3# 
R3# 
R3# sh ip bgp summary
% BGP instance not found
R3# 
R3# 
R3# 
R3# 
R3# sh run
Building configuration...

Current configuration:
!
frr version 9.0.1_git
frr defaults traditional
hostname R3
no ipv6 forwarding
!
interface eth1
 ip address 20.0.13.2/30
 mpls enable
exit
!
interface eth2
 ip address 20.0.23.2/30
 mpls enable
exit
!
interface eth3
 ip address 20.0.34.1/30
 mpls enable
exit
!
interface lo
 ip address 3.3.3.3/32
 mpls enable
exit
!
router ospf
 network 3.3.3.3/32 area 0.0.0.0
 network 20.0.13.0/30 area 0.0.0.0
 network 20.0.23.0/30 area 0.0.0.0
 network 20.0.34.0/30 area 0.0.0.0
exit
!
mpls ldp
 router-id 3.3.3.3
 !
 address-family ipv4
  discovery transport-address 3.3.3.3
  !
  interface eth1
  exit
  !
  interface eth2
  exit
  !
  interface eth3
  exit
  !
 exit-address-family
 !
exit
!
end
R3# 
R3# 
R3# 
R3# 
R3# 
R3# sh run
Building configuration...

Current configuration:
!
frr version 9.0.1_git
frr defaults traditional
hostname R3
no ipv6 forwarding
!
interface eth1
 ip address 20.0.13.2/30
 mpls enable
exit
!
interface eth2
 ip address 20.0.23.2/30
 mpls enable
exit
!
interface eth3
 ip address 20.0.34.1/30
 mpls enable
exit
!
interface lo
 ip address 3.3.3.3/32
 mpls enable
exit
!
router ospf
 network 3.3.3.3/32 area 0.0.0.0
 network 20.0.13.0/30 area 0.0.0.0
 network 20.0.23.0/30 area 0.0.0.0
 network 20.0.34.0/30 area 0.0.0.0
exit
!
mpls ldp
 router-id 3.3.3.3
 !
 address-family ipv4
  discovery transport-address 3.3.3.3
  !
  interface eth1
  exit
  !
  interface eth2
  exit
  !
  interface eth3
  exit
  !
 exit-address-family
 !
exit
!
end
R3# 
